---
title: IntersectingElementData
classe: Autodesk.Revit.DB.IntersectingElementData
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# IntersectingElementData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId IntersectedElementId { get; }` | `intersectingElementData.IntersectedElementId` | ElementId |
| `ElementId IntersectingElementId { get; }` | `intersectingElementData.IntersectingElementId` | ElementId |
| `IntersectionType IntersectionType { get; }` | `intersectingElementData.IntersectionType` | IntersectionType |
| `Double IntersectionVolume { get; }` | `intersectingElementData.IntersectionVolume` | Double |
| `Boolean IsValidObject { get; }` | `intersectingElementData.IsValidObject` | Boolean |
| `Void Dispose()` | `intersectingElementData.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```